Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_TShapeProfile
The IFC2X3_ParametricObject_TShapeProfile class contains the T-shape profile definition.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_TShapeProfile.Depth
The depth.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_TShapeProfile.FlangeWidth
The flange width.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_TShapeProfile.WebThickness
The web thickness.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_TShapeProfile.FlangeThickness
The flange thickness.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_TShapeProfile.FilletRadius
The fillet radius.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_TShapeProfile.FlangeEdgeRadius
The flange edge radius.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_TShapeProfile.WebEdgeRadius
The web edge radius.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_TShapeProfile.WebSlope
The web slope.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_TShapeProfile.FlangeSlope
The flange slope.